# Valenok. Низкоуровневые технические требования.

## Состав и компоновка контроллера

Электрическая часть контроллера конструктивно состоит из трех основных плат:
 
 * Силовая плата.
 * Плата управления.
 * Плата звена постоянного тока. 
 
На плату управления может дополнительно устанавливаться плата расширения с разъемами. 

## Силовая плата

Силовая плата представляет из себя одностороннюю плату на алюминиевом основани.
Количество слоев меди - 1 или 2.
Толщина медного покрытия каждого слоя - не менее 100 мкм. 

Инвертор собирается на транзисторах [BSC077N12NS3GATMA1](https://www.digikey.com/en/products/detail/infineon-technologies/BSC077N12NS3GATMA1/2337847).
Транзисторы включаются параллельно по 3 шт. В цепи затвора каждого транзистора должен быть включен резистор. Номинал резистора рассчитывается исходя из емкости затвора и
максимального тока драйвера. На плате также должен устанавливаться резистор затворов параллельно включенных транзисторов. На первой итерации он будет заменен перемычкой.
Рядом с каждым транзисторным полумостом на плате устанавливается драйвер. 
Требования к полумостовому драйверу:
 
 * Максимальный ток - не менее 3 А, лучше 4 А.
 * Максимальное напряжение полумоста - не менее 120 В.
 * Раздельное независимое управление верхним и нижним транзисторами. 
 * Встроенная UVLO защита. 
 * Встроенная защита от сквозного тока.

Например, драйвер [UCC27282](https://www.ti.com/lit/ds/snvsaq5a/snvsaq5a.pdf?ts=1602424164509).
